*** src/corpus/resolve.rs:163:5: replace harvest_frontmatter -> Vec<(String, String)> with vec![("xyzzy".into(), "xyzzy".into())]

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace harvest_frontmatter -> Vec<(String, String)> with vec![("xyzzy".into(), "xyzzy".into())]
@@ -155,32 +155,17 @@
     out.into_iter().collect()
 }
 
 /// `(target, edge_type)` pairs from the document's frontmatter
 /// `relationships` array. Entries missing a `target` are skipped;
 /// entries missing a `type` default to `references`.
 fn harvest_frontmatter(doc: &LoadedDocument) -> Vec<(String, String)> {
     // Header tier only (CR-047): resolution stays eager with zero body parses.
-    let Some(fm) = doc.frontmatter() else {
-        return Vec::new();
-    };
-    let Some(rels) = fm.get("relationships").and_then(|v| v.as_array()) else {
-        return Vec::new();
-    };
-    rels.iter()
-        .filter_map(|entry| {
-            let target = entry.get("target").and_then(|v| v.as_str())?;
-            let edge_type = entry
-                .get("type")
-                .and_then(|v| v.as_str())
-                .unwrap_or("references");
-            Some((target.to_string(), edge_type.to_string()))
-        })
-        .collect()
+    vec![("xyzzy".into(), "xyzzy".into())] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Raw `ix://` URIs found in the document body.
 fn harvest_body_links(doc: &LoadedDocument, re: &Regex) -> Vec<String> {
     re.find_iter(doc.raw())
         .map(|m| m.as_str().to_string())
         .collect()
 }

---- corpus::resolve::tests::absent_target_is_dangling stdout ----

thread 'corpus::resolve::tests::absent_target_is_dangling' (3917485) panicked at src/corpus/resolve.rs:356:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "StR-999"

---- corpus::query::tests::referencing_is_reverse_lookup stdout ----

thread 'corpus::query::tests::referencing_is_reverse_lookup' (3917483) panicked at src/corpus/query.rs:181:9:
assertion `left == right` failed
  left: 0
 right: 1

---- corpus::query::tests::orphans_finds_untraced_frs stdout ----

thread 'corpus::query::tests::orphans_finds_untraced_frs' (3917481) panicked at src/corpus/query.rs:196:9:
assertion `left == right` failed
  left: ["FR-001", "FR-002"]
 right: ["FR-002"]

failures:
    corpus::query::tests::orphans_finds_untraced_frs
    corpus::query::tests::referencing_is_reverse_lookup
    corpus::resolve::tests::absent_target_is_dangling
    corpus::resolve::tests::dedup_collapses_identical_triples
    corpus::resolve::tests::frontmatter_relationship_resolves
    corpus::resolve::tests::relative_path_link_resolves_and_dangles
    corpus::resolve::tests::resolved_edge_is_bidirectional
    corpus::spec::tests::tc817_queries_parse_zero_bodies

test result: FAILED. 497 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.98s

*** result: Failure(101)
