*** src/corpus/resolve.rs:183:5: replace harvest_body_links -> Vec<String> with vec![]

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace harvest_body_links -> Vec<String> with vec![]
@@ -175,19 +175,17 @@
                 .unwrap_or("references");
             Some((target.to_string(), edge_type.to_string()))
         })
         .collect()
 }
 
 /// Raw `ix://` URIs found in the document body.
 fn harvest_body_links(doc: &LoadedDocument, re: &Regex) -> Vec<String> {
-    re.find_iter(doc.raw())
-        .map(|m| m.as_str().to_string())
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve internal relative-path links (`[text](./FR-002-….md)`) in the
 /// document body against the corpus path index (FR-026-AC-9). A link whose
 /// normalized destination matches a loaded document yields that document's
 /// id; one that matches nothing yields the raw destination string, so it
 /// resolves to `Dangling` downstream like an absent `ix://` target.
 fn harvest_body_relative_links(

---- corpus::resolve::tests::body_link_resolves stdout ----

thread 'corpus::resolve::tests::body_link_resolves' (3920728) panicked at src/corpus/resolve.rs:354:69:
called `Option::unwrap()` on a `None` value

---- corpus::resolve::tests::dedup_collapses_identical_triples stdout ----

thread 'corpus::resolve::tests::dedup_collapses_identical_triples' (3920730) panicked at src/corpus/resolve.rs:451:9:
assertion `left == right` failed
  left: {"implements"}
 right: {"implements", "references"}

---- corpus::spec::tests::tc817_queries_parse_zero_bodies stdout ----

thread 'corpus::spec::tests::tc817_queries_parse_zero_bodies' (3920744) panicked at src/corpus/spec.rs:302:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    corpus::resolve::tests::body_link_resolves
    corpus::resolve::tests::dedup_collapses_identical_triples
    corpus::spec::tests::tc817_queries_parse_zero_bodies

test result: FAILED. 502 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.05s

*** result: Failure(101)
