*** src/corpus/resolve.rs:183:5: replace harvest_body_links -> Vec<String> with vec![String::new()]

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace harvest_body_links -> Vec<String> with vec![String::new()]
@@ -175,19 +175,17 @@
                 .unwrap_or("references");
             Some((target.to_string(), edge_type.to_string()))
         })
         .collect()
 }
 
 /// Raw `ix://` URIs found in the document body.
 fn harvest_body_links(doc: &LoadedDocument, re: &Regex) -> Vec<String> {
-    re.find_iter(doc.raw())
-        .map(|m| m.as_str().to_string())
-        .collect()
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve internal relative-path links (`[text](./FR-002-….md)`) in the
 /// document body against the corpus path index (FR-026-AC-9). A link whose
 /// normalized destination matches a loaded document yields that document's
 /// id; one that matches nothing yields the raw destination string, so it
 /// resolves to `Dangling` downstream like an absent `ix://` target.
 fn harvest_body_relative_links(

---- corpus::query::tests::dangling_appears_in_outgoing_not_referencing stdout ----

thread 'corpus::query::tests::dangling_appears_in_outgoing_not_referencing' (3923948) panicked at src/corpus/query.rs:220:9:
assertion `left == right` failed
  left: 2
 right: 1

---- corpus::resolve::tests::absent_target_is_dangling stdout ----

thread 'corpus::resolve::tests::absent_target_is_dangling' (3923957) panicked at src/corpus/resolve.rs:369:9:
assertion `left == right` failed
  left: ""
 right: "StR-999"

---- corpus::resolve::tests::body_link_resolves stdout ----

thread 'corpus::resolve::tests::body_link_resolves' (3923958) panicked at src/corpus/resolve.rs:354:69:
called `Option::unwrap()` on a `None` value

failures:
    corpus::query::tests::dangling_appears_in_outgoing_not_referencing
    corpus::resolve::tests::absent_target_is_dangling
    corpus::resolve::tests::body_link_resolves
    corpus::resolve::tests::cross_spec_target_is_dangling_not_resolved
    corpus::resolve::tests::dedup_collapses_identical_triples
    corpus::resolve::tests::frontmatter_relationship_resolves
    corpus::resolve::tests::relative_path_link_resolves_and_dangles
    corpus::resolve::tests::resolved_edge_is_bidirectional
    corpus::spec::tests::tc817_queries_parse_zero_bodies

test result: FAILED. 496 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.81s

*** result: Failure(101)
