*** src/corpus/resolve.rs:198:5: replace harvest_body_relative_links -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace harvest_body_relative_links -> Vec<String> with vec!["xyzzy".into()]
@@ -190,31 +190,17 @@
 /// normalized destination matches a loaded document yields that document's
 /// id; one that matches nothing yields the raw destination string, so it
 /// resolves to `Dangling` downstream like an absent `ix://` target.
 fn harvest_body_relative_links(
     doc: &LoadedDocument,
     re: &Regex,
     by_path: &HashMap<PathBuf, ArtifactId>,
 ) -> Vec<String> {
-    let base = doc.path.parent().unwrap_or_else(|| Path::new(""));
-    re.captures_iter(doc.raw())
-        .filter_map(|c| c.get(1).map(|m| m.as_str()))
-        .filter_map(|dest| {
-            let path_part = dest.split('#').next().unwrap_or(dest);
-            if !is_relative_md_dest(path_part) {
-                return None;
-            }
-            let normalized = normalize_lexical(&base.join(path_part));
-            Some(match by_path.get(&normalized) {
-                Some(id) => id.clone(),
-                None => dest.to_string(),
-            })
-        })
-        .collect()
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// True when a Markdown link destination is an internal relative path to a
 /// markdown artifact (not an `ix://`/`http(s)`/`mailto:` URI, not a bare
 /// in-document `#anchor`).
 fn is_relative_md_dest(dest: &str) -> bool {
     !dest.is_empty()
         && !dest.contains("://")

---- corpus::query::tests::dangling_appears_in_outgoing_not_referencing stdout ----

thread 'corpus::query::tests::dangling_appears_in_outgoing_not_referencing' (3936896) panicked at src/corpus/query.rs:220:9:
assertion `left == right` failed
  left: 2
 right: 1

---- corpus::resolve::tests::absent_target_is_dangling stdout ----

thread 'corpus::resolve::tests::absent_target_is_dangling' (3936918) panicked at src/corpus/resolve.rs:359:9:
assertion `left == right` failed
  left: 2
 right: 1

---- corpus::resolve::tests::resolved_edge_is_bidirectional stdout ----

thread 'corpus::resolve::tests::resolved_edge_is_bidirectional' (3936928) panicked at src/corpus/resolve.rs:396:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    corpus::query::tests::dangling_appears_in_outgoing_not_referencing
    corpus::resolve::tests::absent_target_is_dangling
    corpus::resolve::tests::nav_documents_excluded_as_relative_source
    corpus::resolve::tests::relative_path_link_resolves_and_dangles
    corpus::resolve::tests::resolved_edge_is_bidirectional
    corpus::spec::tests::tc817_queries_parse_zero_bodies

test result: FAILED. 499 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.00s

*** result: Failure(101)
