*** src/corpus/resolve.rs:203:16: delete ! in harvest_body_relative_links

*** mutation diff:
--- src/corpus/resolve.rs
+++ delete ! in harvest_body_relative_links
@@ -195,17 +195,17 @@
     re: &Regex,
     by_path: &HashMap<PathBuf, ArtifactId>,
 ) -> Vec<String> {
     let base = doc.path.parent().unwrap_or_else(|| Path::new(""));
     re.captures_iter(doc.raw())
         .filter_map(|c| c.get(1).map(|m| m.as_str()))
         .filter_map(|dest| {
             let path_part = dest.split('#').next().unwrap_or(dest);
-            if !is_relative_md_dest(path_part) {
+            if  /* ~ changed by cargo-mutants ~ */is_relative_md_dest(path_part) {
                 return None;
             }
             let normalized = normalize_lexical(&base.join(path_part));
             Some(match by_path.get(&normalized) {
                 Some(id) => id.clone(),
                 None => dest.to_string(),
             })
         })

---- corpus::resolve::tests::nav_documents_excluded_as_relative_source stdout ----

thread 'corpus::resolve::tests::nav_documents_excluded_as_relative_source' (3940178) panicked at src/corpus/resolve.rs:542:9:
assertion `left == right` failed
  left: 0
 right: 1

---- corpus::resolve::tests::relative_path_link_resolves_and_dangles stdout ----

thread 'corpus::resolve::tests::relative_path_link_resolves_and_dangles' (3940180) panicked at src/corpus/resolve.rs:489:14:
called `Option::unwrap()` on a `None` value

---- corpus::spec::tests::tc817_queries_parse_zero_bodies stdout ----

thread 'corpus::spec::tests::tc817_queries_parse_zero_bodies' (3940188) panicked at src/corpus/spec.rs:302:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    corpus::resolve::tests::nav_documents_excluded_as_relative_source
    corpus::resolve::tests::relative_path_link_resolves_and_dangles
    corpus::spec::tests::tc817_queries_parse_zero_bodies

test result: FAILED. 502 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.90s

*** result: Failure(101)
