*** src/corpus/resolve.rs:219:5: replace is_relative_md_dest -> bool with true

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace is_relative_md_dest -> bool with true
@@ -211,22 +211,17 @@
         })
         .collect()
 }
 
 /// True when a Markdown link destination is an internal relative path to a
 /// markdown artifact (not an `ix://`/`http(s)`/`mailto:` URI, not a bare
 /// in-document `#anchor`).
 fn is_relative_md_dest(dest: &str) -> bool {
-    !dest.is_empty()
-        && !dest.contains("://")
-        && !dest.starts_with('#')
-        && !dest.starts_with("mailto:")
-        && !dest.starts_with("tel:")
-        && dest.ends_with(".md")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// `index.md` / `log.md` are navigation documents, not reference sources.
 fn is_nav_doc(path: &Path) -> bool {
     matches!(
         path.file_name().and_then(|n| n.to_str()),
         Some("index.md") | Some("log.md")
     )

---- corpus::spec::tests::tc817_queries_parse_zero_bodies stdout ----

thread 'corpus::spec::tests::tc817_queries_parse_zero_bodies' (3943441) panicked at src/corpus/spec.rs:302:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    corpus::spec::tests::tc817_queries_parse_zero_bodies

test result: FAILED. 504 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.84s

*** result: Failure(101)
