*** src/corpus/resolve.rs:223:12: delete ! in is_relative_md_dest

*** mutation diff:
--- src/corpus/resolve.rs
+++ delete ! in is_relative_md_dest
@@ -215,17 +215,17 @@
 /// True when a Markdown link destination is an internal relative path to a
 /// markdown artifact (not an `ix://`/`http(s)`/`mailto:` URI, not a bare
 /// in-document `#anchor`).
 fn is_relative_md_dest(dest: &str) -> bool {
     !dest.is_empty()
         && !dest.contains("://")
         && !dest.starts_with('#')
         && !dest.starts_with("mailto:")
-        && !dest.starts_with("tel:")
+        &&  /* ~ changed by cargo-mutants ~ */dest.starts_with("tel:")
         && dest.ends_with(".md")
 }
 
 /// `index.md` / `log.md` are navigation documents, not reference sources.
 fn is_nav_doc(path: &Path) -> bool {
     matches!(
         path.file_name().and_then(|n| n.to_str()),
         Some("index.md") | Some("log.md")

---- corpus::resolve::tests::nav_documents_excluded_as_relative_source stdout ----

thread 'corpus::resolve::tests::nav_documents_excluded_as_relative_source' (3981268) panicked at src/corpus/resolve.rs:542:9:
assertion `left == right` failed
  left: 0
 right: 1

---- corpus::resolve::tests::relative_path_link_resolves_and_dangles stdout ----

thread 'corpus::resolve::tests::relative_path_link_resolves_and_dangles' (3981270) panicked at src/corpus/resolve.rs:489:14:
called `Option::unwrap()` on a `None` value

failures:
    corpus::resolve::tests::nav_documents_excluded_as_relative_source
    corpus::resolve::tests::relative_path_link_resolves_and_dangles

test result: FAILED. 503 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.84s

*** result: Failure(101)
