*** src/corpus/resolve.rs:229:5: replace is_nav_doc -> bool with false

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace is_nav_doc -> bool with false
@@ -221,20 +221,17 @@
         && !dest.starts_with('#')
         && !dest.starts_with("mailto:")
         && !dest.starts_with("tel:")
         && dest.ends_with(".md")
 }
 
 /// `index.md` / `log.md` are navigation documents, not reference sources.
 fn is_nav_doc(path: &Path) -> bool {
-    matches!(
-        path.file_name().and_then(|n| n.to_str()),
-        Some("index.md") | Some("log.md")
-    )
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Normalized on-disk path → artifact id for every loaded document.
 fn build_path_index(documents: &[LoadedDocument]) -> HashMap<PathBuf, ArtifactId> {
     documents
         .iter()
         .map(|d| (normalize_lexical(&d.path), artifact_key(d)))
         .collect()

---- corpus::resolve::tests::nav_documents_excluded_as_relative_source stdout ----

thread 'corpus::resolve::tests::nav_documents_excluded_as_relative_source' (3987751) panicked at src/corpus/resolve.rs:539:9:
assertion `left == right` failed
  left: 3
 right: 1

failures:
    corpus::resolve::tests::nav_documents_excluded_as_relative_source

test result: FAILED. 504 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.19s

*** result: Failure(101)
