*** src/corpus/resolve.rs:237:5: replace build_path_index -> HashMap<PathBuf, ArtifactId> with HashMap::from_iter([(Default::default(), Default::default())])

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace build_path_index -> HashMap<PathBuf, ArtifactId> with HashMap::from_iter([(Default::default(), Default::default())])
@@ -229,20 +229,17 @@
     matches!(
         path.file_name().and_then(|n| n.to_str()),
         Some("index.md") | Some("log.md")
     )
 }
 
 /// Normalized on-disk path → artifact id for every loaded document.
 fn build_path_index(documents: &[LoadedDocument]) -> HashMap<PathBuf, ArtifactId> {
-    documents
-        .iter()
-        .map(|d| (normalize_lexical(&d.path), artifact_key(d)))
-        .collect()
+    HashMap::from_iter([(Default::default(), Default::default())]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Lexically normalize a path — collapse `.` and `..` segments without any
 /// filesystem access (resolution stays I/O-free and deterministic,
 /// StR-006-AC-4 / NFR-006).
 pub(crate) fn normalize_lexical(p: &Path) -> PathBuf {
     let mut out = PathBuf::new();
     for comp in p.components() {

---- corpus::resolve::tests::nav_documents_excluded_as_relative_source stdout ----

thread 'corpus::resolve::tests::nav_documents_excluded_as_relative_source' (3994253) panicked at src/corpus/resolve.rs:539:9:
assertion `left == right` failed
  left: 0
 right: 1

---- corpus::resolve::tests::relative_path_link_resolves_and_dangles stdout ----

thread 'corpus::resolve::tests::relative_path_link_resolves_and_dangles' (3994255) panicked at src/corpus/resolve.rs:486:14:
called `Option::unwrap()` on a `None` value

failures:
    corpus::resolve::tests::nav_documents_excluded_as_relative_source
    corpus::resolve::tests::relative_path_link_resolves_and_dangles

test result: FAILED. 503 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.11s

*** result: Failure(101)
