*** src/corpus/resolve.rs:247:5: replace normalize_lexical -> PathBuf with Default::default()

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace normalize_lexical -> PathBuf with Default::default()
@@ -239,27 +239,17 @@
         .map(|d| (normalize_lexical(&d.path), artifact_key(d)))
         .collect()
 }
 
 /// Lexically normalize a path — collapse `.` and `..` segments without any
 /// filesystem access (resolution stays I/O-free and deterministic,
 /// StR-006-AC-4 / NFR-006).
 pub(crate) fn normalize_lexical(p: &Path) -> PathBuf {
-    let mut out = PathBuf::new();
-    for comp in p.components() {
-        match comp {
-            Component::CurDir => {}
-            Component::ParentDir => {
-                out.pop();
-            }
-            other => out.push(other.as_os_str()),
-        }
-    }
-    out
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn md_link_regex() -> Regex {
     // Match a Markdown inline link's destination: `[text](dest)`, where
     // `dest` runs up to the closing paren or whitespace. `ix://` and other
     // URI/anchor destinations are filtered out by `is_relative_md_dest`.
     Regex::new(r#"\[[^\]]*\]\(([^)\s]+)\)"#).expect("static md-link regex is valid")
 }

---- corpus::resolve::tests::relative_path_link_resolves_and_dangles stdout ----

thread 'corpus::resolve::tests::relative_path_link_resolves_and_dangles' (3997543) panicked at src/corpus/resolve.rs:479:14:
called `Option::unwrap()` on a `None` value

---- corpus::unlinked::tests::bare_id_in_prose_is_autofix stdout ----

thread 'corpus::unlinked::tests::bare_id_in_prose_is_autofix' (3997554) panicked at src/corpus/unlinked.rs:356:9:
assertion `left == right` failed
  left: Some("[FR-008](.)")
 right: Some("[FR-008](./FR-008-byte-exact.md)")

---- corpus::unlinked::tests::inline_code_token_converted stdout ----

thread 'corpus::unlinked::tests::inline_code_token_converted' (3997556) panicked at src/corpus/unlinked.rs:394:9:
assertion `left == right` failed
  left: Some("[FR-008](.)")
 right: Some("[FR-008](./FR-008-byte-exact.md)")

failures:
    corpus::resolve::tests::relative_path_link_resolves_and_dangles
    corpus::unlinked::tests::bare_id_in_prose_is_autofix
    corpus::unlinked::tests::inline_code_token_converted
    corpus::unlinked::tests::sub_id_links_to_parent_file

test result: FAILED. 501 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.13s

*** result: Failure(101)
