*** src/corpus/resolve.rs:270:5: replace extract_target_id -> &str with "xyzzy"

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace extract_target_id -> &str with "xyzzy"
@@ -262,18 +262,17 @@
     // `dest` runs up to the closing paren or whitespace. `ix://` and other
     // URI/anchor destinations are filtered out by `is_relative_md_dest`.
     Regex::new(r#"\[[^\]]*\]\(([^)\s]+)\)"#).expect("static md-link regex is valid")
 }
 
 /// The artifact id a reference target points at: the last `/`-segment
 /// of an `ix://` URI, or a bare id unchanged (FR-026-AC-6).
 pub(crate) fn extract_target_id(target: &str) -> &str {
-    let rest = target.strip_prefix("ix://").unwrap_or(target);
-    rest.rsplit('/').next().unwrap_or(rest)
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 fn ix_link_regex() -> Regex {
     // Match an ix:// URI up to whitespace or a closing delimiter so it
     // works for `[t](ix://…)`, `<ix://…>`, and bare occurrences.
     Regex::new(r#"ix://[^\s)\]>"']+"#).expect("static ix-link regex is valid")
 }

---- corpus::resolve::tests::absent_target_is_dangling stdout ----

thread 'corpus::resolve::tests::absent_target_is_dangling' (4004061) panicked at src/corpus/resolve.rs:370:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "StR-999"

---- corpus::query::tests::referencing_is_reverse_lookup stdout ----

thread 'corpus::query::tests::referencing_is_reverse_lookup' (4004059) panicked at src/corpus/query.rs:181:9:
assertion `left == right` failed
  left: 0
 right: 1

---- corpus::resolve::tests::extract_target_id_handles_uri_and_bare stdout ----

thread 'corpus::resolve::tests::extract_target_id_handles_uri_and_bare' (4004065) panicked at src/corpus/resolve.rs:286:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "FR-021"

failures:
    corpus::query::tests::orphans_finds_untraced_frs
    corpus::query::tests::referencing_is_reverse_lookup
    corpus::resolve::tests::absent_target_is_dangling
    corpus::resolve::tests::body_link_resolves
    corpus::resolve::tests::cross_spec_target_is_dangling_not_resolved
    corpus::resolve::tests::dedup_collapses_identical_triples
    corpus::resolve::tests::extract_target_id_handles_uri_and_bare
    corpus::resolve::tests::frontmatter_relationship_resolves
    corpus::resolve::tests::resolved_edge_is_bidirectional
    corpus::spec::tests::tc817_queries_parse_zero_bodies

test result: FAILED. 495 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.20s

*** result: Failure(101)
