*** src/corpus/resolve.rs:91:12: delete ! in resolve

*** mutation diff:
--- src/corpus/resolve.rs
+++ delete ! in resolve
@@ -83,17 +83,17 @@
                 source.clone(),
                 extract_target_id(&target_raw).to_string(),
                 "references".to_string(),
             ));
         }
         // Internal relative-path links (ADR 0007). Navigation documents
         // (`index.md`/`log.md`) are excluded as a source so their
         // wall-to-wall contents links do not flood the graph (FR-026-AC-10).
-        if !is_nav_doc(&doc.path) {
+        if  /* ~ changed by cargo-mutants ~ */is_nav_doc(&doc.path) {
             for target in harvest_body_relative_links(doc, &md_link, &by_path) {
                 stubs.insert((source.clone(), target, "references".to_string()));
             }
         }
     }
 
     let mut edges = Vec::with_capacity(stubs.len());
     let mut outgoing: BTreeMap<ArtifactId, Vec<usize>> = BTreeMap::new();

---- corpus::resolve::tests::nav_documents_excluded_as_relative_source stdout ----

thread 'corpus::resolve::tests::nav_documents_excluded_as_relative_source' (3880985) panicked at src/corpus/resolve.rs:542:9:
assertion `left == right` failed
  left: 2
 right: 1

---- corpus::resolve::tests::relative_path_link_resolves_and_dangles stdout ----

thread 'corpus::resolve::tests::relative_path_link_resolves_and_dangles' (3880987) panicked at src/corpus/resolve.rs:489:14:
called `Option::unwrap()` on a `None` value

failures:
    corpus::resolve::tests::nav_documents_excluded_as_relative_source
    corpus::resolve::tests::relative_path_link_resolves_and_dangles

test result: FAILED. 503 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.38s

*** result: Failure(101)
