*** src/corpus/resolve.rs:219:5: replace is_relative_md_dest -> bool with false

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace is_relative_md_dest -> bool with false
@@ -211,22 +211,17 @@
         })
         .collect()
 }
 
 /// True when a Markdown link destination is an internal relative path to a
 /// markdown artifact (not an `ix://`/`http(s)`/`mailto:` URI, not a bare
 /// in-document `#anchor`).
 fn is_relative_md_dest(dest: &str) -> bool {
-    !dest.is_empty()
-        && !dest.contains("://")
-        && !dest.starts_with('#')
-        && !dest.starts_with("mailto:")
-        && !dest.starts_with("tel:")
-        && dest.ends_with(".md")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// `index.md` / `log.md` are navigation documents, not reference sources.
 fn is_nav_doc(path: &Path) -> bool {
     matches!(
         path.file_name().and_then(|n| n.to_str()),
         Some("index.md") | Some("log.md")
     )

---- corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing stdout ----

thread 'corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing' (4076793) panicked at src/corpus/resolve.rs:585:9:
assertion failed: is_relative_md_dest("./FR-002-graph-edges.md")

---- corpus::resolve::tests::nav_documents_excluded_as_relative_source stdout ----

thread 'corpus::resolve::tests::nav_documents_excluded_as_relative_source' (4076789) panicked at src/corpus/resolve.rs:537:9:
assertion `left == right` failed
  left: 0
 right: 1

---- corpus::resolve::tests::relative_path_link_resolves_and_dangles stdout ----

thread 'corpus::resolve::tests::relative_path_link_resolves_and_dangles' (4076791) panicked at src/corpus/resolve.rs:484:14:
called `Option::unwrap()` on a `None` value

failures:
    corpus::resolve::tests::nav_documents_excluded_as_relative_source
    corpus::resolve::tests::relative_path_link_resolves_and_dangles
    corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing

test result: FAILED. 504 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.11s

*** result: Failure(101)
