*** src/corpus/resolve.rs:220:9: replace && with || in is_relative_md_dest

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace && with || in is_relative_md_dest
@@ -212,17 +212,17 @@
         .collect()
 }
 
 /// True when a Markdown link destination is an internal relative path to a
 /// markdown artifact (not an `ix://`/`http(s)`/`mailto:` URI, not a bare
 /// in-document `#anchor`).
 fn is_relative_md_dest(dest: &str) -> bool {
     !dest.is_empty()
-        && !dest.contains("://")
+        || /* ~ changed by cargo-mutants ~ */ !dest.contains("://")
         && !dest.starts_with('#')
         && !dest.starts_with("mailto:")
         && !dest.starts_with("tel:")
         && dest.ends_with(".md")
 }
 
 /// `index.md` / `log.md` are navigation documents, not reference sources.
 fn is_nav_doc(path: &Path) -> bool {

---- corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing stdout ----

thread 'corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing' (4093012) panicked at src/corpus/resolve.rs:606:13:
"https://example.com/a.md" must not be harvested as a relative-path stub

---- corpus::resolve::tests::tc897_excluded_destinations_mint_no_edges stdout ----

thread 'corpus::resolve::tests::tc897_excluded_destinations_mint_no_edges' (4093013) panicked at src/corpus/resolve.rs:625:9:

---- corpus::spec::tests::tc817_queries_parse_zero_bodies stdout ----

thread 'corpus::spec::tests::tc817_queries_parse_zero_bodies' (4093020) panicked at src/corpus/spec.rs:302:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing
    corpus::resolve::tests::tc897_excluded_destinations_mint_no_edges
    corpus::spec::tests::tc817_queries_parse_zero_bodies

test result: FAILED. 504 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.84s

*** result: Failure(101)
