*** src/corpus/resolve.rs:222:12: delete ! in is_relative_md_dest

*** mutation diff:
--- src/corpus/resolve.rs
+++ delete ! in is_relative_md_dest
@@ -214,17 +214,17 @@
 
 /// True when a Markdown link destination is an internal relative path to a
 /// markdown artifact (not an `ix://`/`http(s)`/`mailto:` URI, not a bare
 /// in-document `#anchor`).
 fn is_relative_md_dest(dest: &str) -> bool {
     !dest.is_empty()
         && !dest.contains("://")
         && !dest.starts_with('#')
-        && !dest.starts_with("mailto:")
+        &&  /* ~ changed by cargo-mutants ~ */dest.starts_with("mailto:")
         && !dest.starts_with("tel:")
         && dest.ends_with(".md")
 }
 
 /// `index.md` / `log.md` are navigation documents, not reference sources.
 fn is_nav_doc(path: &Path) -> bool {
     matches!(
         path.file_name().and_then(|n| n.to_str()),

---- corpus::resolve::tests::relative_path_link_resolves_and_dangles stdout ----

thread 'corpus::resolve::tests::relative_path_link_resolves_and_dangles' (4106015) panicked at src/corpus/resolve.rs:489:14:
called `Option::unwrap()` on a `None` value

---- corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing stdout ----

thread 'corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing' (4106017) panicked at src/corpus/resolve.rs:590:9:
assertion failed: is_relative_md_dest("./FR-002-graph-edges.md")

---- corpus::resolve::tests::tc897_excluded_destinations_mint_no_edges stdout ----

thread 'corpus::resolve::tests::tc897_excluded_destinations_mint_no_edges' (4106018) panicked at src/corpus/resolve.rs:625:9:
no excluded destination may mint an edge, got [Edge { source: "FR-001", target: "mailto:a@b.com.md", edge_type: "references", resolution: Dangling }]

failures:
    corpus::resolve::tests::nav_documents_excluded_as_relative_source
    corpus::resolve::tests::relative_path_link_resolves_and_dangles
    corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing
    corpus::resolve::tests::tc897_excluded_destinations_mint_no_edges

test result: FAILED. 503 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.08s

*** result: Failure(101)
