*** src/corpus/resolve.rs:224:9: replace && with || in is_relative_md_dest

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace && with || in is_relative_md_dest
@@ -216,17 +216,17 @@
 /// markdown artifact (not an `ix://`/`http(s)`/`mailto:` URI, not a bare
 /// in-document `#anchor`).
 fn is_relative_md_dest(dest: &str) -> bool {
     !dest.is_empty()
         && !dest.contains("://")
         && !dest.starts_with('#')
         && !dest.starts_with("mailto:")
         && !dest.starts_with("tel:")
-        && dest.ends_with(".md")
+        || /* ~ changed by cargo-mutants ~ */ dest.ends_with(".md")
 }
 
 /// `index.md` / `log.md` are navigation documents, not reference sources.
 fn is_nav_doc(path: &Path) -> bool {
     matches!(
         path.file_name().and_then(|n| n.to_str()),
         Some("index.md") | Some("log.md")
     )

---- corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing stdout ----

thread 'corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing' (4080084) panicked at src/corpus/resolve.rs:606:13:
"https://example.com/a.md" must not be harvested as a relative-path stub

---- corpus::resolve::tests::tc897_excluded_destinations_mint_no_edges stdout ----

thread 'corpus::resolve::tests::tc897_excluded_destinations_mint_no_edges' (4080085) panicked at src/corpus/resolve.rs:625:9:

failures:
    corpus::resolve::tests::tc897_every_relative_destination_exclusion_is_load_bearing
    corpus::resolve::tests::tc897_excluded_destinations_mint_no_edges

test result: FAILED. 505 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.00s

*** result: Failure(101)
