*** src/corpus/resolve.rs:229:5: replace is_nav_doc -> bool with true

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace is_nav_doc -> bool with true
@@ -221,20 +221,17 @@
         && !dest.starts_with('#')
         && !dest.starts_with("mailto:")
         && !dest.starts_with("tel:")
         && dest.ends_with(".md")
 }
 
 /// `index.md` / `log.md` are navigation documents, not reference sources.
 fn is_nav_doc(path: &Path) -> bool {
-    matches!(
-        path.file_name().and_then(|n| n.to_str()),
-        Some("index.md") | Some("log.md")
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Normalized on-disk path → artifact id for every loaded document.
 fn build_path_index(documents: &[LoadedDocument]) -> HashMap<PathBuf, ArtifactId> {
     documents
         .iter()
         .map(|d| (normalize_lexical(&d.path), artifact_key(d)))
         .collect()

---- corpus::resolve::tests::nav_documents_excluded_as_relative_source stdout ----

thread 'corpus::resolve::tests::nav_documents_excluded_as_relative_source' (4112535) panicked at src/corpus/resolve.rs:539:9:
assertion `left == right` failed
  left: 0
 right: 1

---- corpus::resolve::tests::relative_path_link_resolves_and_dangles stdout ----

thread 'corpus::resolve::tests::relative_path_link_resolves_and_dangles' (4112537) panicked at src/corpus/resolve.rs:486:14:
called `Option::unwrap()` on a `None` value

failures:
    corpus::resolve::tests::nav_documents_excluded_as_relative_source
    corpus::resolve::tests::relative_path_link_resolves_and_dangles

test result: FAILED. 505 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.24s

*** result: Failure(101)
