*** src/corpus/resolve.rs:270:5: replace extract_target_id -> &str with ""

*** mutation diff:
--- src/corpus/resolve.rs
+++ replace extract_target_id -> &str with ""
@@ -262,18 +262,17 @@
     // `dest` runs up to the closing paren or whitespace. `ix://` and other
     // URI/anchor destinations are filtered out by `is_relative_md_dest`.
     Regex::new(r#"\[[^\]]*\]\(([^)\s]+)\)"#).expect("static md-link regex is valid")
 }
 
 /// The artifact id a reference target points at: the last `/`-segment
 /// of an `ix://` URI, or a bare id unchanged (FR-026-AC-6).
 pub(crate) fn extract_target_id(target: &str) -> &str {
-    let rest = target.strip_prefix("ix://").unwrap_or(target);
-    rest.rsplit('/').next().unwrap_or(rest)
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 fn ix_link_regex() -> Regex {
     // Match an ix:// URI up to whitespace or a closing delimiter so it
     // works for `[t](ix://…)`, `<ix://…>`, and bare occurrences.
     Regex::new(r#"ix://[^\s)\]>"']+"#).expect("static ix-link regex is valid")
 }

---- corpus::query::tests::orphans_finds_untraced_frs stdout ----

thread 'corpus::query::tests::orphans_finds_untraced_frs' (4128875) panicked at src/corpus/query.rs:196:9:
assertion `left == right` failed
  left: ["FR-001", "FR-002"]
 right: ["FR-002"]

---- corpus::resolve::tests::extract_target_id_handles_uri_and_bare stdout ----

thread 'corpus::resolve::tests::extract_target_id_handles_uri_and_bare' (4128883) panicked at src/corpus/resolve.rs:286:9:
assertion `left == right` failed
  left: ""
 right: "FR-021"

---- corpus::resolve::tests::body_link_resolves stdout ----

thread 'corpus::resolve::tests::body_link_resolves' (4128880) panicked at src/corpus/resolve.rs:355:69:
called `Option::unwrap()` on a `None` value

failures:
    corpus::query::tests::orphans_finds_untraced_frs
    corpus::query::tests::referencing_is_reverse_lookup
    corpus::resolve::tests::absent_target_is_dangling
    corpus::resolve::tests::body_link_resolves
    corpus::resolve::tests::cross_spec_target_is_dangling_not_resolved
    corpus::resolve::tests::dedup_collapses_identical_triples
    corpus::resolve::tests::extract_target_id_handles_uri_and_bare
    corpus::resolve::tests::frontmatter_relationship_resolves
    corpus::resolve::tests::resolved_edge_is_bidirectional
    corpus::spec::tests::tc817_queries_parse_zero_bodies

test result: FAILED. 497 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.42s

*** result: Failure(101)
